sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    motion_write_pin(motion_decode_pin(config->direction_pin),
                     positive != config->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    motion_write_pin(
        motion_decode_pin(active_motion_axes[axis].step_pin), high);
    return true;
}

static bool board_motion_limit_active(uint8_t axis, bool* active) {
    if (axis >= active_motion_axis_count || active == NULL) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    if (config->limit_pin == UINT16_MAX) {
        *active = false;
        return true;
    }
    const motion_pin_t pin = motion_decode_pin(config->limit_pin);
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const bool high = (gpio->IDR & (uint16_t)(1U << pin.pin)) != 0U;
    *active = config->limit_active_low ? !high : high;
    return true;
}

/* TIM2 以 1MHz 自由运行，结合溢出中断构成单调的 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 169U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U &&
        counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM2_CH1 只在下一条运动边沿到期时触发，不再占用 TIM4。 */
static bool motion_schedule_compare(uint64_t deadline_ns) {
    uint64_t deadline_us = deadline_ns / 1000ULL;
    if ((deadline_ns % 1000ULL) != 0U && deadline_us != UINT64_MAX) {
        ++deadline_us;
    }
    const uint64_t now_us = board_motion_nanoseconds() / 1000ULL;
    uint64_t delta_us = deadline_us > now_us
                            ? deadline_us - now_us
                            : 0U;
    if (delta_us < CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        delta_us = CONFIG_MOTION_COMPARE_MIN_LEAD_US;
    }
    if (delta_us > INT32_MAX) {
        delta_us = INT32_MAX;
    }

    TIM2->DIER &= ~TIM_DIER_CC1IE;
    uint32_t target = TIM2->CNT + (uint32_t)delta_us;
    TIM2->CCR1 = target;
    TIM2->SR = ~TIM_SR_CC1IF;
    if ((int32_t)(target - TIM2->CNT) <
        (int32_t)CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        target = TIM2->CNT + CONFIG_MOTION_COMPARE_MIN_LEAD_US;
        TIM2->CCR1 = target;
        TIM2->SR = ~TIM_SR_CC1IF;
    }
    TIM2->DIER |= TIM_DIER_CC1IE;
    return true;
}

static void motion_cancel_compare(void) {
    TIM2->DIER &= ~TIM_DIER_CC1IE;
    TIM2->SR = ~TIM_SR_CC1IF;
}

static uint32_t motion_enter_critical(void) {
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    __DMB();
    return state;
}

static void motion_exit_critical(uint32_t state) {
    __DMB();
    if (state == 0U) {
        __enable_irq();
    }
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
void HAL_UART_MspInit(UART_HandleTypeDef* handle) {
    GPIO_InitTypeDef init = {0};
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    init.Alternate = GPIO_AF7_USART1;

    if (handle->Instance == USART1) {
        __HAL_RCC_USART1_CLK_ENABLE();
#if defined(CONFIG_UART0_PINS_PA9_PA10)
        __HAL_RCC_GPIOA_CLK_ENABLE();
        init.Pin = GPIO_PIN_9 | GPIO_PIN_10;
        HAL_GPIO_Init(GPIOA, &init);
#else
        __HAL_RCC_GPIOB_CLK_ENABLE();
        init.Pin = GPIO_PIN_6 | GPIO_PIN_7;
        HAL_GPIO_Init(GPIOB, &init);
#endif
        return;
    }

#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 1
    if (handle->Instance == USART2) {
        __HAL_RCC_USART2_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();
        init.Alternate = GPIO_AF7_USART2;
        init.Pin = GPIO_PIN_2 | GPIO_PIN_3;
        HAL_GPIO_Init(GPIOA, &init);
        return;
    }
#endif

#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 2
    if (handle->Instance == USART3) {
        __HAL_RCC_USART3_CLK_ENABLE();
        __HAL_RCC_GPIOB_CLK_ENABLE();
        init.Alternate = GPIO_AF7_USART3;
        init.Pin = GPIO_PIN_10 | GPIO_PIN_11;
        HAL_GPIO_Init(GPIOB, &init);
    }
#endif
}

static USART_TypeDef* hardware_uart_instance(uint8_t port) {
    switch (port) {
        case 0U:
            return USART1;
#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 1
        case 1U:
            return USART2;
#endif
#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 2
        case 2U:
            return USART3;
#endif
        default:
            return NULL;
    }
}

static IRQn_Type hardware_uart_irq(uint8_t port) {
    switch (port) {
        case 0U:
            return USART1_IRQn;
#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 1
        case 1U:
            return USART2_IRQn;
#endif
#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 2
        case 2U:
            return USART3_IRQn;
#endif
        default:
            return NonMaskableInt_IRQn;
    }
}

static void board_hardware_uart_stop(uint8_t port) {
    if (port >= CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return;
    }
    UART_HandleTypeDef* const handle = &hardware_uart_handles[port];
    HAL_NVIC_DisableIRQ(hardware_uart_irq(port));
    hardware_uart_configured[port] = false;
    if (handle->Instance == hardware_uart_instance(port)) {
        (void)HAL_UART_DeInit(handle);
    }
    rbsp_byte_ring_clear(&hardware_uart_rx_rings[port]);
    rbsp_byte_ring_clear(&hardware_uart_tx_rings[port]);
}

static bool board_hardware_uart_configure(uint8_t port, uint32_t baud_rate,
                                          uint8_t data_bits,
                                          uint8_t stop_bits,
                                          uint8_t parity) {
    if (port >= CONFIG_HARDWARE_UART_RESOURCE_COUNT ||
        baud_rate < 300U || stop_bits < 1U || stop_bits > 2U || parity > 2U) {
        return false;
    }

    const uint32_t peripheral_clock =
        port == 0U ? HAL_RCC_GetPCLK2Freq() : HAL_RCC_GetPCLK1Freq();
    if (baud_rate > peripheral_clock / 16U) {
        return false;
    }

    uint32_t word_length;
    if (parity == 0U && data_bits == 8U) {
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 7U) {
        /* STM32 的字长包含校验位：7 数据位 + 1 校验位。 */
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 8U) {
        /* STM32 的字长包含校验位：8 数据位 + 1 校验位。 */
        word_length = UART_WORDLENGTH_9B;
    } else {
        return false;
    }

    board_hardware_uart_stop(port);
    UART_HandleTypeDef* const handle = &hardware_uart_handles[port];
    memset(handle, 0, sizeof(*handle));
    handle->Instance = hardware_uart_instance(port);
    handle->Init.BaudRate = baud_rate;
    handle->Init.WordLength = word_length;
    handle->Init.StopBits =
        stop_bits == 1U ? UART_STOPBITS_1 : UART_STOPBITS_2;
    handle->Init.Parity =
        parity == 0U ? UART_PARITY_NONE
                     : (parity == 1U ? UART_PARITY_ODD : UART_PARITY_EVEN);
    handle->Init.Mode = UART_MODE_TX_RX;
    handle->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    handle->Init.OverSampling = UART_OVERSAMPLING_16;
    handle->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    handle->Init.ClockPrescaler = UART_PRESCALER_DIV1;
    handle->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(handle) != HAL_OK) {
        return false;
    }

    __HAL_UART_CLEAR_FLAG(
        handle, UART_CLEAR_OREF | UART_CLEAR_NEF |
                    UART_CLEAR_FEF | UART_CLEAR_PEF);
    __HAL_UART_ENABLE_IT(handle, UART_IT_RXNE);
    __HAL_UART_ENABLE_IT(handle, UART_IT_ERR);
    hardware_uart_configured[port] = true;
    const IRQn_Type irq = hardware_uart_irq(port);
    HAL_NVIC_SetPriority(irq, 1U, 0U);
    HAL_NVIC_EnableIRQ(irq);
    return true;
}

static size_t board_hardware_uart_read(uint8_t port, uint8_t* data,
                                       size_t capacity) {
    if (port >= CONFIG_HARDWARE_UART_RESOURCE_COUNT ||
        !hardware_uart_configured[port] || data == NULL) {
        return 0U;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const size_t count =
        rbsp_byte_ring_read(&hardware_uart_rx_rings[port], data, capacity);
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return count;
}

static bool board_hardware_uart_write(uint8_t port, const uint8_t* data,
                                      size_t length) {
    if (port >= CONFIG_HARDWARE_UART_RESOURCE_COUNT ||
        !hardware_uart_configured[port] || data == NULL || length == 0U) {
        return false;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const bool accepted =
        rbsp_byte_ring_write_exact(&hardware_uart_tx_rings[port], data, length);
    if (accepted) {
        __HAL_UART_ENABLE_IT(&hardware_uart_handles[port], UART_IT_TXE);
    }
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return accepted;
}

static void hardware_uart_irq_service(uint8_t port) {
    if (port >= CONFIG_HARDWARE_UART_RESOURCE_COUNT ||
        !hardware_uart_configured[port]) {
        return;
    }

    UART_HandleTypeDef* const handle = &hardware_uart_handles[port];
    const uint32_t status = handle->Instance->ISR;
    const uint32_t receive_flags =
        USART_ISR_RXNE_RXFNE | USART_ISR_ORE | USART_ISR_NE |
        USART_ISR_FE | USART_ISR_PE;
    if ((status & receive_flags) != 0U) {
        if ((status & USART_ISR_RXNE_RXFNE) != 0U) {
            const uint8_t value = (uint8_t)handle->Instance->RDR;
            if (rbsp_byte_ring_push(&hardware_uart_rx_rings[port], value)) {
                ++rbsp_diag_uart_rx_bytes;
            } else {
                ++rbsp_diag_uart_rx_overflows;
            }
        }
        if ((status & (USART_ISR_ORE | USART_ISR_NE |
                       USART_ISR_FE | USART_ISR_PE)) != 0U) {
            handle->Instance->ICR =
                USART_ICR_ORECF | USART_ICR_NECF |
                USART_ICR_FECF | USART_ICR_PECF;
            ++rbsp_diag_uart_errors;
        }
    }

    if ((handle->Instance->ISR & USART_ISR_TXE_TXFNF) != 0U &&
        (handle->Instance->CR1 & USART_CR1_TXEIE_TXFNFIE) != 0U) {
        uint8_t value;
        if (rbsp_byte_ring_pop(&hardware_uart_tx_rings[port], &value)) {
            handle->Instance->TDR = value;
            ++rbsp_diag_uart_tx_bytes;
        } else {
            __HAL_UART_DISABLE_IT(handle, UART_IT_TXE);
        }
    }
}
#endif

#if CONFIG_UART_RESOURCE_COUNT > 0
static bool board_uart_configure(uint8_t port, uint32_t baud_rate,
                                 uint8_t data_bits, uint8_t stop_bits,
                                 uint8_t parity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
#ifdef RBSP_STUDIO_STATIC_RESOURCE_TABLE
        if (!rbsp_static_uart_allows(
                rbsp_studio_uart_resources,
                RBSP_STUDIO_UART_RESOURCE_COUNT, port, baud_rate)) {
            return false;
        }
#endif
        return board_hardware_uart_configure(
            port, baud_rate, data_bits, stop_bits, parity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_configure(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        baud_rate, data_bits, stop_bits, parity);
#endif
    return false;
}

static size_t board_uart_read(uint8_t port, uint8_t* data,
                              size_t capacity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_read(port, data, capacity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_read(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE), data, capacity);
#endif
    return 0U;
}

